app/views/user/books/index.html.erb

SELECT "books".* FROM "books"
---
        	    <td>
        	    	<% if book.book_image.present? %>

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
              </td>
							<td><%= book.book_comments.count %> / <%= book.favorites.count %></td>