app/views/user/books/show.html.erb

              <%= link_to book_favorite_path(@book), method: :delete do %>
              ♥<%= @book.favorites.count %>いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

        </thead>
        <% if @book.book_comments.empty? %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT  1 AS one FROM "book_comments" WHERE "book_comments"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 1]]

        <% else %>
        <% @book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]