app/views/admin/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
            <% if @book.favorited_by?(@book.user) %>
              ♥<%= @book.favorites.count %>いいね
            <% else %>
              ♡<%= @book.favorites.count %>いいね

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT  1 AS one FROM "book_comments" WHERE "book_comments"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 1]]
---
        </thead>
        <% if @book.book_comments.empty? %>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
        <% else %>
        <% @book.book_comments.each do |book_comment| %>