app/controllers/admin/books_controller.rb

  def update
    @book = Book.find(params[:id])
    @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "name" = ?, "body" = ?, "book_image_id" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["name", "bba"], ["body", "bba"], ["book_image_id", nil], ["updated_at", "2021-04-21 05:37:51.881616"], ["id", 2]]