app/controllers/admin/book_comments_controller.rb

  def destroy
    book = Book.find(params[:book_id])
    book_comment = BookComment.find_by(book_id: book.id)
    book_comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 16]]