app/controllers/admin/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "aa"], ["updated_at", "2021-04-19 06:25:11.870154"], ["id", 1]]