app/controllers/user/books_controller.rb

INSERT INTO "books" ("name", "body", "user_id", "book_image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = current_user
    @book = Book.new(book_params)
    @book.user_id = @user.id
    @book.save!