app/controllers/user/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "aaa"], ["updated_at", "2021-04-18 06:42:20.863282"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)